garyPenhook/PIC-Assembler/device_includes/pic16f18155.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0292h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0006h
OSCTUNE_TUN_LENGTH                       equ 0006h
OSCTUNE_TUN_MASK                         equ 003Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h
OSCTUNE_TUN5_POSN                        equ 0005h
OSCTUNE_TUN5_POSITION                    equ 0005h
OSCTUNE_TUN5_SIZE                        equ 0001h
OSCTUNE_TUN5_LENGTH                      equ 0001h
OSCTUNE_TUN5_MASK                        equ 0020h

// Register: OSCFRQ
#define OSCFRQ OSCFRQ
OSCFRQ                                   equ 0293h
// bitfield definitions
OSCFRQ_FRQ_POSN                          equ 0000h
OSCFRQ_FRQ_POSITION                      equ 0000h
OSCFRQ_FRQ_SIZE                          equ 0003h
OSCFRQ_FRQ_LENGTH                        equ 0003h
OSCFRQ_FRQ_MASK                          equ 0007h
OSCFRQ_FRQ0_POSN                         equ 0000h
OSCFRQ_FRQ0_POSITION                     equ 0000h
OSCFRQ_FRQ0_SIZE                         equ 0001h
OSCFRQ_FRQ0_LENGTH                       equ 0001h
OSCFRQ_FRQ0_MASK                         equ 0001h
OSCFRQ_FRQ1_POSN                         equ 0001h
OSCFRQ_FRQ1_POSITION                     equ 0001h
OSCFRQ_FRQ1_SIZE                         equ 0001h
OSCFRQ_FRQ1_LENGTH                       equ 0001h
OSCFRQ_FRQ1_MASK                         equ 0002h
OSCFRQ_FRQ2_POSN                         equ 0002h
OSCFRQ_FRQ2_POSITION                     equ 0002h
OSCFRQ_FRQ2_SIZE                         equ 0001h
OSCFRQ_FRQ2_LENGTH                       equ 0001h
OSCFRQ_FRQ2_MASK                         equ 0004h

// Register: ACTCON
#define ACTCON ACTCON
ACTCON                                   equ 0294h
// bitfield definitions
ACTCON_ACTORS_POSN                       equ 0001h
ACTCON_ACTORS_POSITION                   equ 0001h
ACTCON_ACTORS_SIZE                       equ 0001h
ACTCON_ACTORS_LENGTH                     equ 0001h
ACTCON_ACTORS_MASK                       equ 0002h
ACTCON_ACTLOCK_POSN                      equ 0003h
ACTCON_ACTLOCK_POSITION                  equ 0003h
ACTCON_ACTLOCK_SIZE                      equ 0001h
ACTCON_ACTLOCK_LENGTH                    equ 0001h
ACTCON_ACTLOCK_MASK                      equ 0008h
ACTCON_ACTUD_POSN                        equ 0006h
ACTCON_ACTUD_POSITION                    equ 0006h
ACTCON_ACTUD_SIZE                        equ 0001h
ACTCON_ACTUD_LENGTH                      equ 0001h
ACTCON_ACTUD_MASK                        equ 0040h
ACTCON_ACTEN_POSN                        equ 0007h
ACTCON_ACTEN_POSITION                    equ 0007h
ACTCON_ACTEN_SIZE                        equ 0001h
ACTCON_ACTEN_LENGTH                      equ 0001h
ACTCON_ACTEN_MASK                        equ 0080h

// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 0296h
// bitfield definitions
CLKRCON_DIV_POSN                         equ 0000h
CLKRCON_DIV_POSITION                     equ 0000h
CLKRCON_DIV_SIZE                         equ 0003h
CLKRCON_DIV_LENGTH                       equ 0003h
CLKRCON_DIV_MASK                         equ 0007h
CLKRCON_DC_POSN                          equ 0003h
CLKRCON_DC_POSITION                      equ 0003h
CLKRCON_DC_SIZE                          equ 0002h
CLKRCON_DC_LENGTH                        equ 0002h
CLKRCON_DC_MASK                          equ 0018h
CLKRCON_EN_POSN                          equ 0007h
CLKRCON_EN_POSITION                      equ 0007h
CLKRCON_EN_SIZE                          equ 0001h
CLKRCON_EN_LENGTH                        equ 0001h
CLKRCON_EN_MASK                          equ 0080h
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_DIV0_POSN                        equ 0000h
CLKRCON_DIV0_POSITION                    equ 0000h
CLKRCON_DIV0_SIZE                        equ 0001h
CLKRCON_DIV0_LENGTH                      equ 0001h
CLKRCON_DIV0_MASK                        equ 0001h
CLKRCON_DIV1_POSN                        equ 0001h
CLKRCON_DIV1_POSITION                    equ 0001h
CLKRCON_DIV1_SIZE                        equ 0001h
CLKRCON_DIV1_LENGTH                      equ 0001h
CLKRCON_DIV1_MASK                        equ 0002h
CLKRCON_DIV2_POSN                        equ 0002h
CLKRCON_DIV2_POSITION                    equ 0002h
CLKRCON_DIV2_SIZE                        equ 0001h
CLKRCON_DIV2_LENGTH                      equ 0001h
CLKRCON_DIV2_MASK                        equ 0004h
CLKRCON_DC0_POSN                         equ 0003h
CLKRCON_DC0_POSITION                     equ 0003h
CLKRCON_DC0_SIZE                         equ 0001h
CLKRCON_DC0_LENGTH                       equ 0001h
CLKRCON_DC0_MASK                         equ 0008h
CLKRCON_DC1_POSN                         equ 0004h
CLKRCON_DC1_POSITION                     equ 0004h
CLKRCON_DC1_SIZE                         equ 0001h
CLKRCON_DC1_LENGTH                       equ 0001h
CLKRCON_DC1_MASK                         equ 0010h

