garyPenhook/PIC-Assembler/device_includes/pic16f18155.inc
// Register: ADREF
#define ADREF ADREF
ADREF                                    equ 01D2Bh
// bitfield definitions
ADREF_PREF_POSN                          equ 0000h
ADREF_PREF_POSITION                      equ 0000h
ADREF_PREF_SIZE                          equ 0004h
ADREF_PREF_LENGTH                        equ 0004h
ADREF_PREF_MASK                          equ 000Fh
ADREF_NREF_POSN                          equ 0004h
ADREF_NREF_POSITION                      equ 0004h
ADREF_NREF_SIZE                          equ 0004h
ADREF_NREF_LENGTH                        equ 0004h
ADREF_NREF_MASK                          equ 00F0h
ADREF_ADPREF_POSN                        equ 0000h
ADREF_ADPREF_POSITION                    equ 0000h
ADREF_ADPREF_SIZE                        equ 0004h
ADREF_ADPREF_LENGTH                      equ 0004h
ADREF_ADPREF_MASK                        equ 000Fh
ADREF_ADNREF_POSN                        equ 0004h
ADREF_ADNREF_POSITION                    equ 0004h
ADREF_ADNREF_SIZE                        equ 0004h
ADREF_ADNREF_LENGTH                      equ 0004h
ADREF_ADNREF_MASK                        equ 00F0h
ADREF_PREF0_POSN                         equ 0000h
ADREF_PREF0_POSITION                     equ 0000h
ADREF_PREF0_SIZE                         equ 0001h
ADREF_PREF0_LENGTH                       equ 0001h
ADREF_PREF0_MASK                         equ 0001h
ADREF_PREF1_POSN                         equ 0001h
ADREF_PREF1_POSITION                     equ 0001h
ADREF_PREF1_SIZE                         equ 0001h
ADREF_PREF1_LENGTH                       equ 0001h
ADREF_PREF1_MASK                         equ 0002h
ADREF_NREF0_POSN                         equ 0004h
ADREF_NREF0_POSITION                     equ 0004h
ADREF_NREF0_SIZE                         equ 0001h
ADREF_NREF0_LENGTH                       equ 0001h
ADREF_NREF0_MASK                         equ 0010h
ADREF_ADPREF0_POSN                       equ 0000h
ADREF_ADPREF0_POSITION                   equ 0000h
ADREF_ADPREF0_SIZE                       equ 0001h
ADREF_ADPREF0_LENGTH                     equ 0001h
ADREF_ADPREF0_MASK                       equ 0001h
ADREF_ADPREF1_POSN                       equ 0001h
ADREF_ADPREF1_POSITION                   equ 0001h
ADREF_ADPREF1_SIZE                       equ 0001h
ADREF_ADPREF1_LENGTH                     equ 0001h
ADREF_ADPREF1_MASK                       equ 0002h
ADREF_ADNREF0_POSN                       equ 0004h
ADREF_ADNREF0_POSITION                   equ 0004h
ADREF_ADNREF0_SIZE                       equ 0001h
ADREF_ADNREF0_LENGTH                     equ 0001h
ADREF_ADNREF0_MASK                       equ 0010h

// Register: ADACT
#define ADACT ADACT
ADACT                                    equ 01D2Ch
// bitfield definitions
ADACT_ACT_POSN                           equ 0000h
ADACT_ACT_POSITION                       equ 0000h
ADACT_ACT_SIZE                           equ 0006h
ADACT_ACT_LENGTH                         equ 0006h
ADACT_ACT_MASK                           equ 003Fh
ADACT_ADACT0_POSN                        equ 0000h
ADACT_ADACT0_POSITION                    equ 0000h
ADACT_ADACT0_SIZE                        equ 0001h
ADACT_ADACT0_LENGTH                      equ 0001h
ADACT_ADACT0_MASK                        equ 0001h
ADACT_ADACT1_POSN                        equ 0001h
ADACT_ADACT1_POSITION                    equ 0001h
ADACT_ADACT1_SIZE                        equ 0001h
ADACT_ADACT1_LENGTH                      equ 0001h
ADACT_ADACT1_MASK                        equ 0002h
ADACT_ADACT2_POSN                        equ 0002h
ADACT_ADACT2_POSITION                    equ 0002h
ADACT_ADACT2_SIZE                        equ 0001h
ADACT_ADACT2_LENGTH                      equ 0001h
ADACT_ADACT2_MASK                        equ 0004h
ADACT_ADACT3_POSN                        equ 0003h
ADACT_ADACT3_POSITION                    equ 0003h
ADACT_ADACT3_SIZE                        equ 0001h
ADACT_ADACT3_LENGTH                      equ 0001h
ADACT_ADACT3_MASK                        equ 0008h
ADACT_ADACT4_POSN                        equ 0004h
ADACT_ADACT4_POSITION                    equ 0004h
ADACT_ADACT4_SIZE                        equ 0001h
ADACT_ADACT4_LENGTH                      equ 0001h
ADACT_ADACT4_MASK                        equ 0010h
ADACT_ADACT_POSN                         equ 0000h
ADACT_ADACT_POSITION                     equ 0000h
ADACT_ADACT_SIZE                         equ 0006h
ADACT_ADACT_LENGTH                       equ 0006h
ADACT_ADACT_MASK                         equ 003Fh
ADACT_ACT0_POSN                          equ 0000h
ADACT_ACT0_POSITION                      equ 0000h
ADACT_ACT0_SIZE                          equ 0001h
ADACT_ACT0_LENGTH                        equ 0001h
ADACT_ACT0_MASK                          equ 0001h
ADACT_ACT1_POSN                          equ 0001h
ADACT_ACT1_POSITION                      equ 0001h
ADACT_ACT1_SIZE                          equ 0001h
ADACT_ACT1_LENGTH                        equ 0001h
ADACT_ACT1_MASK                          equ 0002h
ADACT_ACT2_POSN                          equ 0002h
ADACT_ACT2_POSITION                      equ 0002h
ADACT_ACT2_SIZE                          equ 0001h
ADACT_ACT2_LENGTH                        equ 0001h
ADACT_ACT2_MASK                          equ 0004h
ADACT_ACT3_POSN                          equ 0003h
ADACT_ACT3_POSITION                      equ 0003h
ADACT_ACT3_SIZE                          equ 0001h
ADACT_ACT3_LENGTH                        equ 0001h
ADACT_ACT3_MASK                          equ 0008h
ADACT_ACT4_POSN                          equ 0004h
ADACT_ACT4_POSITION                      equ 0004h
ADACT_ACT4_SIZE                          equ 0001h
ADACT_ACT4_LENGTH                        equ 0001h
ADACT_ACT4_MASK                          equ 0010h

// Register: ADCLK
#define ADCLK ADCLK
ADCLK                                    equ 01D2Dh
// bitfield definitions
ADCLK_CS_POSN                            equ 0000h
ADCLK_CS_POSITION                        equ 0000h
ADCLK_CS_SIZE                            equ 0006h
ADCLK_CS_LENGTH                          equ 0006h
ADCLK_CS_MASK                            equ 003Fh
ADCLK_ADCS0_POSN                         equ 0000h
ADCLK_ADCS0_POSITION                     equ 0000h
ADCLK_ADCS0_SIZE                         equ 0001h
ADCLK_ADCS0_LENGTH                       equ 0001h
ADCLK_ADCS0_MASK                         equ 0001h
ADCLK_ADCS1_POSN                         equ 0001h
ADCLK_ADCS1_POSITION                     equ 0001h
ADCLK_ADCS1_SIZE                         equ 0001h
ADCLK_ADCS1_LENGTH                       equ 0001h
ADCLK_ADCS1_MASK                         equ 0002h
ADCLK_ADCS2_POSN                         equ 0002h
ADCLK_ADCS2_POSITION                     equ 0002h
ADCLK_ADCS2_SIZE                         equ 0001h
ADCLK_ADCS2_LENGTH                       equ 0001h
ADCLK_ADCS2_MASK                         equ 0004h
ADCLK_ADCS3_POSN                         equ 0003h
ADCLK_ADCS3_POSITION                     equ 0003h
ADCLK_ADCS3_SIZE                         equ 0001h
ADCLK_ADCS3_LENGTH                       equ 0001h
ADCLK_ADCS3_MASK                         equ 0008h
ADCLK_ADCS4_POSN                         equ 0004h
ADCLK_ADCS4_POSITION                     equ 0004h
ADCLK_ADCS4_SIZE                         equ 0001h
ADCLK_ADCS4_LENGTH                       equ 0001h
ADCLK_ADCS4_MASK                         equ 0010h
ADCLK_ADCS5_POSN                         equ 0005h
ADCLK_ADCS5_POSITION                     equ 0005h
ADCLK_ADCS5_SIZE                         equ 0001h
ADCLK_ADCS5_LENGTH                       equ 0001h
ADCLK_ADCS5_MASK                         equ 0020h
ADCLK_ADCS_POSN                          equ 0000h
ADCLK_ADCS_POSITION                      equ 0000h
ADCLK_ADCS_SIZE                          equ 0006h
ADCLK_ADCS_LENGTH                        equ 0006h
ADCLK_ADCS_MASK                          equ 003Fh
ADCLK_CS0_POSN                           equ 0000h
ADCLK_CS0_POSITION                       equ 0000h
ADCLK_CS0_SIZE                           equ 0001h
ADCLK_CS0_LENGTH                         equ 0001h
ADCLK_CS0_MASK                           equ 0001h
ADCLK_CS1_POSN                           equ 0001h
ADCLK_CS1_POSITION                       equ 0001h
ADCLK_CS1_SIZE                           equ 0001h
ADCLK_CS1_LENGTH                         equ 0001h
ADCLK_CS1_MASK                           equ 0002h
ADCLK_CS2_POSN                           equ 0002h
ADCLK_CS2_POSITION                       equ 0002h
ADCLK_CS2_SIZE                           equ 0001h
ADCLK_CS2_LENGTH                         equ 0001h
ADCLK_CS2_MASK                           equ 0004h
ADCLK_CS3_POSN                           equ 0003h
ADCLK_CS3_POSITION                       equ 0003h
ADCLK_CS3_SIZE                           equ 0001h
ADCLK_CS3_LENGTH                         equ 0001h
ADCLK_CS3_MASK                           equ 0008h
ADCLK_CS4_POSN                           equ 0004h
ADCLK_CS4_POSITION                       equ 0004h
ADCLK_CS4_SIZE                           equ 0001h
ADCLK_CS4_LENGTH                         equ 0001h
ADCLK_CS4_MASK                           equ 0010h
ADCLK_CS5_POSN                           equ 0005h
ADCLK_CS5_POSITION                       equ 0005h
ADCLK_CS5_SIZE                           equ 0001h
ADCLK_CS5_LENGTH                         equ 0001h
ADCLK_CS5_MASK                           equ 0020h

// Register: ADCG1A
#define ADCG1A ADCG1A
ADCG1A                                   equ 01D2Eh
// bitfield definitions
ADCG1A_CGA0_POSN                         equ 0000h
ADCG1A_CGA0_POSITION                     equ 0000h
ADCG1A_CGA0_SIZE                         equ 0001h
ADCG1A_CGA0_LENGTH                       equ 0001h
ADCG1A_CGA0_MASK                         equ 0001h
ADCG1A_CGA1_POSN                         equ 0001h
ADCG1A_CGA1_POSITION                     equ 0001h
ADCG1A_CGA1_SIZE                         equ 0001h
ADCG1A_CGA1_LENGTH                       equ 0001h
ADCG1A_CGA1_MASK                         equ 0002h
ADCG1A_CGA2_POSN                         equ 0002h
ADCG1A_CGA2_POSITION                     equ 0002h
ADCG1A_CGA2_SIZE                         equ 0001h
ADCG1A_CGA2_LENGTH                       equ 0001h
ADCG1A_CGA2_MASK                         equ 0004h
ADCG1A_CGA3_POSN                         equ 0003h
ADCG1A_CGA3_POSITION                     equ 0003h
ADCG1A_CGA3_SIZE                         equ 0001h
ADCG1A_CGA3_LENGTH                       equ 0001h
ADCG1A_CGA3_MASK                         equ 0008h
ADCG1A_CGA4_POSN                         equ 0004h
ADCG1A_CGA4_POSITION                     equ 0004h
ADCG1A_CGA4_SIZE                         equ 0001h
ADCG1A_CGA4_LENGTH                       equ 0001h
ADCG1A_CGA4_MASK                         equ 0010h
ADCG1A_CGA5_POSN                         equ 0005h
ADCG1A_CGA5_POSITION                     equ 0005h
ADCG1A_CGA5_SIZE                         equ 0001h
ADCG1A_CGA5_LENGTH                       equ 0001h
ADCG1A_CGA5_MASK                         equ 0020h
ADCG1A_CGA6_POSN                         equ 0006h
ADCG1A_CGA6_POSITION                     equ 0006h
ADCG1A_CGA6_SIZE                         equ 0001h
ADCG1A_CGA6_LENGTH                       equ 0001h
ADCG1A_CGA6_MASK                         equ 0040h
ADCG1A_CGA7_POSN                         equ 0007h
ADCG1A_CGA7_POSITION                     equ 0007h
ADCG1A_CGA7_SIZE                         equ 0001h
ADCG1A_CGA7_LENGTH                       equ 0001h
ADCG1A_CGA7_MASK                         equ 0080h

